
## Plan Result (dev)

[CI link](https://github.com/goda6565/portfolio/actions/runs/15137508299)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service will be created
  + resource "google_cloud_run_v2_service" "cloudrun_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "frontend-feat"
      + observed_generation     = (known after apply)
      + project                 = "portfolio-460206"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "nginx:latest"

              + ports (known after apply)

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label dev/add-or-update: POST https://api.github.com/repos/goda6565/portfolio/issues/30/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":30,"Program":"tfcmt","SHA1":"178c322e0676384c371ffe9f6b55bc8cd1749528","Target":"dev","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->